app/Controllers/EmployeesController.php

    public function edit($id){
        helper('form');
        $model = new EmployeesModel();
        $employee = $model->find($id);
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '4'