app/Controllers/EmployeesController.php

SELECT *
FROM `employees`
ORDER BY `id` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `employees`
SELECT COUNT(*) AS `numrows`
FROM `employees`
WHERE   (
`gender` = 'male'
OR `gender` = 'm'
 )
SELECT COUNT(*) AS `numrows`
FROM `employees`
WHERE   (
`gender` = 'female'
OR `gender` = 'f'
 )
---
    public function index(){
        // return view('employees/index');
        $employeesModel = model(EmployeesModel::class);
        // Pagination
        $perPage = 5;
        $employees = $employeesModel->orderBy('id', 'ASC')->paginate($perPage);
        $pager = $employeesModel->pager;

        // Stats from database (not page-limited)
        $stats = [
            'total'  => (new EmployeesModel())->countAll(),
            'male'   => (new EmployeesModel())->groupStart()->where('gender', 'male')->orWhere('gender', 'm')->groupEnd()->countAllResults(),
            'female' => (new EmployeesModel())->groupStart()->where('gender', 'female')->orWhere('gender', 'f')->groupEnd()->countAllResults(),

INSERT INTO `employees` (`first_name`, `last_name`, `middle_name`, `birthday`, `gender`, `nationality`, `height`, `weight`, `mobile_number`, `province`, `city`) VALUES ('June Rey', 'Palabrica', 'Lanohan', '2025-12-17', 'Male', 'Filipino', '160', '52', '090612345678', 'Negros Island', 'Kabankalan City')
---
        $post = $this->request->getPost(['first_name','last_name','middle_name','birthday','gender','nationality','height','weight','mobile_number','province','city']);

        $model = new EmployeesModel();
        $model->save($post);

SELECT *
FROM `employees`
WHERE `employees`.`id` = '2'
---
    public function edit($id){
        helper('form');
        $model = new EmployeesModel();
        $employee = $model->find($id);